# Generated by pycc
read_verilog -sv pyc_primitives.v
read_verilog -sv davinci_top.v
hierarchy -top davinci_top
proc; opt; memory; opt
synth -top davinci_top
